In [12]:
import pandas as pd

In [13]:
data1=pd.DataFrame({'id':[1,2,3],'a':[10,11,12]})
data2=pd.DataFrame({'id':[2,3,4],'b':[41,42,43]})

In [14]:
data1

   id   a
0   1  10
1   2  11
2   3  12

In [15]:
data2

   id   b
0   2  41
1   3  42
2   4  43

In [16]:
# Intersection
data_inner=pd.merge(data1,data2,how="inner", on="id")
data_inner

   id   a   b
0   2  11  41
1   3  12  42

In [17]:
data_left=pd.merge(data1,data2,how="left", on="id")
data_left

   id   a     b
0   1  10   NaN
1   2  11  41.0
2   3  12  42.0

In [18]:
data_right=pd.merge(data1,data2,how="right", on="id")
data_right

   id     a   b
0   2  11.0  41
1   3  12.0  42
2   4   NaN  43

In [19]:
# Union
data_outer=pd.merge(data1,data2,how="outer", on="id")
data_outer

   id     a     b
0   1  10.0   NaN
1   2  11.0  41.0
2   3  12.0  42.0
3   4   NaN  43.0